CapnRon/gnw-stm32h7b0-diag-firmware/Core/Src/main.c
void uptime_inc(void)
{
  uptime_s++;
}

uint32_t uptime_get(void)
{
  return uptime_s;
}

void GW_EnterDeepSleep(void)
{
  // Stop SAI DMA (audio)
  HAL_SAI_DMAStop(&hsai_BlockA1);

  // Enable wakup by PIN1, the power button
  HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN1_LOW);

  lcd_backlight_off();

  // Deinit the LCD, save power.
  lcd_deinit(&hspi2);

  // Leave a trace in RAM that we entered standby mode
  boot_magic = BOOT_MAGIC_STANDBY;

  // Delay 500ms to give us a chance to attach a debugger in case
  // we end up in a suspend-loop.
  for (int i = 0; i < 10; i++) {
      wdog_refresh();
      HAL_Delay(50);
  }

  HAL_PWR_EnterSTANDBYMode();

  // Execution stops here, this function will not return
  while(1) {
    // If we for some reason survive until here, let's just reboot
    HAL_NVIC_SystemReset();
  }

}

// Returns buttons that were pressed at boot
uint32_t GW_GetBootButtons(void)
{
  return boot_buttons;
}

// Workaround for being able to run with -D_FORTIFY_SOURCE=1
static void memcpy_no_check(uint32_t *dst, uint32_t *src, size_t len)
{
  assert((len & 0b11) == 0);

  uint32_t *end = dst + len / 4;
  while (dst != end) {
    *(dst++) = *(src++);
  }
}

/* Known-good FLASH_OPTSR value, read directly off a reference unit:
 * RDP=0xAA (level 0), IWDG_SW=1, NRST_STDY=1, NRST_STOP=1, IWDG_FZ_STOP=1,
 * IWDG_FZ_SDBY=1, plus one undocumented reserved bit(5) that also reads 1
 * on the reference unit. */
#define TARGET_OPTSR_VALUE   0x1006AAF0u
#define FLASH_OPTSR_CUR_REG  (*(volatile uint32_t *)0x5200201Cu)
#define FLASH_OPTSR_PRG_REG  (*(volatile uint32_t *)0x52002020u)
#define FLASH_OPTKEYR_REG    (*(volatile uint32_t *)0x52002008u)
#define FLASH_OPTCR_REG      (*(volatile uint32_t *)0x52002018u)

/* Set by ensure_option_bytes(): 1 = option bytes already matched the known
 * -good value on this boot, 0 = they had drifted and were just corrected. */
static volatile uint8_t option_bytes_were_ok;

static void ensure_option_bytes(void)
{
  if (FLASH_OPTSR_CUR_REG == TARGET_OPTSR_VALUE) {
    option_bytes_were_ok = 1;
    return;
  }
  option_bytes_were_ok = 0;

  FLASH_OPTKEYR_REG = 0x08192A3Bu;
  FLASH_OPTKEYR_REG = 0x4C5D6E7Fu;

  FLASH_OPTSR_PRG_REG = TARGET_OPTSR_VALUE;
  FLASH_OPTCR_REG = 0x00000002u; /* OPTSTART, OPTLOCK stays cleared */

  while (FLASH_OPTSR_CUR_REG & 0x1u) {
    /* wait for OPT_BUSY to clear */
  }
}

#if 0 /* Disabled: external chip is now PSRAM, not the NOR flash asset blob
       * this sound test streamed from. RAM test build only for now. */
/* --- Diagnostic sound playback: gapless double-buffered SAI/DMA streaming -
 * hdma_sai1_a is configured DMA_CIRCULAR (needed for the real emulator's
 * gapless audio streaming). We exploit that directly instead of fighting
 * it: kick ONE circular DMA transfer covering a two-half buffer, and as
 * hardware plays through each half, refill the *other* (currently silent to
 * the DMA engine) half with the next chunk of source data -- classic
 * ping-pong streaming, no stop/restart, no gaps.
 *
 * There's no real completion IRQ available to hook (HAL_SAI_TxCpltCallback
 * is already strongly defined in common.c for the emulator audio path, and
 * SAI_DMATxCplt() in the HAL explicitly skips resetting hsai->State when
 * DMA mode is circular -- see stm32h7xx_hal_sai.c), so which half is
 * currently playing is tracked by elapsed wall-clock time instead. */
#define SND_SAMPLE_RATE_HZ  48000u                      /* matches MX_SAI1_Init() */
/* hsai_BlockA1.Init.MonoStereoMode = SAI_MONOMODE (confirmed on real hw) --
 * one 16-bit sample per audio frame, not L+R interleaved. */
#define SND_HALF_SAMPLES    4000u                       /* mono samples/half, ~83ms */
#define SND_HALF_DURATION_MS ((SND_HALF_SAMPLES * 1000u) / SND_SAMPLE_RATE_HZ)

static int16_t snd_dbuf[2u * SND_HALF_SAMPLES] __attribute__((aligned(32), section(".diag_ram_emu")));
static const uint8_t *snd_src_ptr;
static uint32_t snd_remaining_bytes;
static volatile uint8_t snd_playing;
static uint32_t snd_playback_start_tick;
static int snd_last_half;
static int snd_drain_halves;

static void snd_refill_half(int half)
{
  int16_t *dst = &snd_dbuf[half * SND_HALF_SAMPLES];
  uint32_t half_bytes = SND_HALF_SAMPLES * 2u;
  uint32_t copy_bytes = (snd_remaining_bytes < half_bytes) ? snd_remaining_bytes : half_bytes;

  if (copy_bytes > 0) {
    memcpy(dst, snd_src_ptr, copy_bytes);
    snd_src_ptr += copy_bytes;
    snd_remaining_bytes -= copy_bytes;

    /* Apply the same 0-255 volume_tbl[] scale the real emulator audio path
     * uses, so this diagnostic respects the same volume level/table. */
    uint8_t vol = volume_tbl[audio_level];
    if (vol != 255) {
      uint32_t sample_count = copy_bytes / 2u;
      for (uint32_t i = 0; i < sample_count; i++) {
        dst[i] = (int16_t)(((int32_t)dst[i] * vol) / 255);
      }
    }
  }
  if (copy_bytes < half_bytes) {
    memset((uint8_t *)dst + copy_bytes, 0, half_bytes - copy_bytes);
    snd_drain_halves++;
  }
  SCB_CleanDCache_by_Addr((uint32_t *)dst, (half_bytes + 31u) & ~31u);
}

static void snd_poll(void)
{
  if (!snd_playing) {
    return;
  }

  uint32_t elapsed_ms = HAL_GetTick() - snd_playback_start_tick;
  int current_half = (int)((elapsed_ms / SND_HALF_DURATION_MS) % 2u);

  if (current_half != snd_last_half) {
    int refill_target = snd_last_half; /* the half that just finished playing */
    snd_last_half = current_half;

    if (snd_drain_halves >= 2) {
      /* both halves have been silence for a full cycle -- clip is done */
      HAL_SAI_DMAStop(&hsai_BlockA1);
      snd_playing = 0;
      return;
    }
    snd_refill_half(refill_target);
  }
}

static void play_random_sound(void)
{
  static uint32_t call_counter;

  if (snd_playing) {
    return; /* don't interrupt currently-playing clip */
  }

  call_counter++;
  uint32_t idx = (HAL_GetTick() + call_counter * 7919u) % SOUND_COUNT;

  snd_src_ptr = (const uint8_t *)(0x90000000u + sound_offsets[idx]);
  snd_remaining_bytes = sound_lengths[idx];
  snd_playing = 1;
  snd_drain_halves = 0;
  snd_last_half = 0;

  snd_refill_half(0);
  snd_refill_half(1);

